tap "duongductrong/snapzy", "https://github.com/duongductrong/Snapzy"
tap "farion1231/ccswitch"
tap "lihaoyun6/tap"
tap "stanmarek/tap"
tap "theboredteam/boring-notch"
tap "zackelia/formulae"
# Library and utilities for processing GIFs
brew "giflib"
# Vector graphics library with cross-device output support
brew "cairo"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Image manipulation library
brew "jpeg"
# Library to render SVG files using Cairo
brew "librsvg"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Selects the right Node package manager based on lockfiles
brew "ni"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm@10", link: true
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Display management tool
cask "betterdisplay"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
# Configuration manager for AI coding agents
cask "cc-switch"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source keystroke visualiser
cask "keycastr"
# Native macOS screenshots, recording, annotation, and editing from the menu bar
cask "duongductrong/snapzy/snapzy"
# System monitor for the menu bar
cask "stats"
# Pin any window to the top of your screen.
cask "lihaoyun6/tap/topit"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "antfu.unocss"
vscode "antfu.where-am-i"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "google.geminicodeassist"
vscode "jmsv.javascriptsnippetsstandard"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liuqixuan.insertnumspro"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "sdras.vue-vscode-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "techer.open-in-browser"
vscode "vizards.deepseek-v4-for-copilot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "zhuxiuxiang.path-prompt"
npm "node-gyp"
npm "prettier"
